%-----------------------------------------------
% 　　　　模拟电路基础：                        
% 　　　　　　从系统级到电路级                  
%-----------------------------------------------
%　　　　陈抗生，周金芳                        
%　　　　科学出版社　2019                      
%-----------------------------------------------
%　　　　中国大学MOOC: 
%  https://www.icourse163.org/course/ZJU-1206452827
%-----------------------------------------------
%
%　　　　参见PPT第10/11页

%%%%%%%%%%%%%%%%%%%%%%%
%         RLC串联电路波特图
L=10e-3; C=1e-6; w0=1/(L*C)^.5;
R=100; Qs=w0*L/R;
grlcs1=tf([R*C 0],[L*C R*C 1])
bode(grlcs1);
grid on;

R=10; Qs=w0*L/R;
grlcs2=tf([R*C 0],[L*C R*C 1])
figure;
bode(grlcs1,'r', grlcs2,'b--');
grid on;legend('Qs=1', 'Qs=10')