%-----------------------------------------------
% 　　　　模拟电路基础：                        
% 　　　　　　从系统级到电路级                  
%-----------------------------------------------
%　　　　陈抗生，周金芳                        
%　　　　科学出版社　2019                      
%-----------------------------------------------
%　　　　中国大学MOOC: 
%  https://www.icourse163.org/course/ZJU-1206452827
%-----------------------------------------------
%
%　　　　参见PPT第15/17页

%%%%%%%%%%%%%%%%%%%%%%%
%         RLC电路阻抗
R=100; L=10e-3; C=1e-6; G=1/R;
% RCL串联电路
Zs=tf([L*C R*C 1],[C 0])
% RCL并联电路
Zp=tf([L 0],[L*C G*L 1])

P = bodeoptions;
P.MagUnits='abs'
bodeplot(Zs, P); grid on;

figure;
bodeplot(Zp, P); grid on;