%-----------------------------------------------
% 　　　　模拟电路基础：                        
% 　　　　　　从系统级到电路级                  
%-----------------------------------------------
%　　　　陈抗生，周金芳                        
%　　　　科学出版社　2019                      
%-----------------------------------------------
%　　　　中国大学MOOC: 
%  https://www.icourse163.org/course/ZJU-1206452827
%-----------------------------------------------
%
%　　　　参见PPT第13页

%%%%%%%%%%%%%%%%%%%%%%%
%         RLC并联电路波特图
L=10e-3; C=1e-6; w0=1/(L*C)^.5;
R=100; G=1/R; Qp=w0*C/G;
grlcp1=tf([G*L 0],[L*C G*L 1])
bode(grlcp1);
grid on;

R=1000; G=1/R; Qp=w0*C/G;
grlcp2=tf([G*L 0],[L*C G*L 1])
figure;
bode(grlcp1,'r', grlcp2,'b--');
grid on;legend('Qp=1', 'Qp=10')