%++++++++++++++++++++++++++++++++++++++++++++++++%
% 　　模拟电路基础——从系统级到电路级             %
%++++++++++++++++++++++++++++++++++++++++++++++++%
% 　　　　　陈抗生　周金芳                       %
%++++++++++++++++++++++++++++++++++++++++++++++++%
% 　　　　 科学出版社　2020                      %
%++++++++++++++++++++++++++++++++++++++++++++++++%
%
% figure 1.4.13 & 1.4.14
%
syms s a1 b1 b2;
H = (a1*s +1)/(b1*s + b2)/s;
h = ilaplace(H)
% we get h = 1/b2 - (exp(-(b2*t)/b1)*(b1 - a1*b2))/(b1*b2)

R1=9e6; Rsc =1e6; C1=9e-12; 

C2=R1*C1/Rsc;		% C2=81pF

t = linspace(0, 50e-4, 101);
a1=C1*R1; b1=C1*R1+C2*R1; b2=1+R1/Rsc;
h = 1/b2 - (exp(-(b2*t)/b1)*(b1 - a1*b2))/(b1*b2);
figure(1)
plot(t, h);
ylim([0 0.11]);
title('with C_1R_1=C_2R_s_c')

C2=100e-12;		    % C2=100pF

a1=C1*R1; b1=C1*R1+C2*R1; b2=1+R1/Rsc;
h = 1/b2 - (exp(-(b2*t)/b1)*(b1 - a1*b2))/(b1*b2);
figure(2)
plot(t, h);
ylim([0 0.11]);
title('with C_1R_1\neqC_2R_s_c')