%-----------------------------------------------
% 　　　　模拟电路基础：                        
% 　　　　　　从系统级到电路级                  
%-----------------------------------------------
%　　　　陈抗生，周金芳                        
%　　　　科学出版社　2019                      
%-----------------------------------------------
%　　　　中国大学MOOC: 
%  https://www.icourse163.org/course/ZJU-1206452827
%-----------------------------------------------
%
%　　　　参见PPT第8页

% R=100 C=1uF
R=100; C=1e-6; 

H=tf([1],[R*C 1])

% setting frequency  range
W=logspace(2,8, 61);

bode(H,W); grid on;